Repository: algorb/thbook_ru
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Now it's possible to insert some { point symbols}.
ru_ru: Теперь можно вставить некоторые { точечные символы}.

source: Now we are ready to describe how the map (or atlas chapter) is constructed:
ru_ru: Теперь мы готовы описать как строится карта (или атлас):

source: Now we're ready to define the || macro.
ru_ru: Теперь мы готовы определить макрос ||.

source: Now, after mastering data and configuration files, we're ready to run Therion.
ru_ru: Теперь, после освоения данных и файлов конфигурации, мы готовы\break запустить Therion.

source: Objects (like survey stations or scraps; see below) which belong to a subsurvey of the current survey are referenced as
ru_ru: Объекты (например станции или скрапы, смотрите ниже), которые относятся к subsurvey текущего survey,\break записываются как

source: Objects { survey}, { centreline}, { scrap}, { point}, { line}, { area}, { map} and { surface} can contain user-defined attributes in a form |-attr <name> <value>|.
ru_ru: Объекты { survey}, { centreline}, { scrap}, { point}, { line}, { area}, { map} и { surface} могут\break содержать пользовательские атрибуты в форме |-attr <имя> <значение>|.\break

source: Oct: Therion 0.4 --- New 3D viewer (Loch).
ru_ru: Октябрь: Therion 0.4 -- Новый 3D-просмотрщик (Loch).

source: Oct: first concrete ideas
ru_ru: Октябрь: первые конкретные идеи.

source: On the other hand smaller scraps will probably be less distorted by map warping algorithms than larger scraps.
ru_ru: С другой стороны, маленькие скрапы, вероятно, будут менее искажены алгоритмами преобразования карт, чем более крупные скрапы.

source: On the other side you have than use longer names in stations references, like |3@dno.katakomby.jmn.dumbier|]
ru_ru: С другой стороны вы можете использовать более длинные имена в ссылках на станции, например |3@dno.katakomby.jmn.dumbier|.].

source: One-line commands and multi-line commands.
ru_ru: Однострочные команды и многострочные команды.

source: Only surveys containing some caves (i.e. entrance stations or surveys with main entrance defined) are present in the final cave list table.
ru_ru: В итоговой таблице присутствуют только съемки, содержащие пещеры (т.е. входные станции или съемки с основным входом).

source: Only the command (|scrap|, |point|, |line|, |text|---why text see below) and its type (for |point| and |line|) or ID (for |scrap|) are shown.
ru_ru: Показываются только команды (|scrap|, |point|, |line|,\break |text| -- почему так, смотрите ниже) и их типы (для |point| и |line|) или ID (для |scrap|).

source: Only the map pages should be counted.
ru_ru: Только страницы карты должны подсчитываться.

source: Only visible symbols are exported.
ru_ru: Экспортируются только видимые символы.

source: Optional units apply to real coordinates (metres by default).
ru_ru: Необязательный параметр единицы применяется к реальным координатам (метры по\break умолчанию).

source: Optionally, you can also specify units for the coordinates of the `points in reality'.
ru_ru: При желании вы также можете указать единицы для координат `точек в реальности'.

source: Or you can completely hide this leg from extended centerline using:
ru_ru: Или вы можете полностью скрыть этот замер, используя:

source: Ordering of symbols inside of each group follows the order of commands in the input fileOr { File commands} menu in XTherion]: symbols which come first are drawn last (i.e. they are displayed at the top of each group).
ru_ru: Порядок символов внутри каждой группы соответствует порядку команд во входном файлеИли в меню {Команды в файле} XTherion'а.]: символы, которые идут первыми, нарисованы последними (т.е. они отображаются в верхней части каждой группы).

source: Original and more complicated way to set-up fonts for PDF maps.
ru_ru: Исходный и более сложный способ настройки шрифтов для PDF-карт.

source: Original survey sketch:
ru_ru: Оригинальный эскиз съемки:

source: Otherwise prefix is left with station names.
ru_ru: В противном случае префикс остается с именами станций.

source: Otherwise survey structure with aggregated ststistics is also displayed.
ru_ru: Иначе отображается структура съемки со статистикой.

source: Otherwise these points are ignored.
ru_ru: В противном случае эти точки игнорируются.

source: PDF files are highly optimized---scraps are stored in XObject forms only once in the document and than referenced on appropriate pages.
ru_ru: Файлы PDF высоко оптимизированы -- скрапы сохраняются только один раз в документе в формах XObject и отображаются на соответствующих страницах.

source: PDF map or atlas: $ 5 5$ m (pdflimit)
ru_ru: PDF-карта или атлас: $ 5 5$ м (ограничение pdf)

source: Page layout in the atlas mode.
ru_ru: Макет страницы в режиме атласа.

source: Page layout in the map mode.
ru_ru: Макет страницы в режиме карты.

source: Path to data and configuration files.
ru_ru: Путь к файлам данных и конфигурации.

source: Path where temporary directory should be created.
ru_ru: Путь, где должен быть создан временный каталог;

source: Patterns are defined using the same user interface (without the |patterncolor| macro) as described in the article
ru_ru: Шаблоны определяются с использованием того же пользовательского\break интерфейса (без макроса |patterncolor|), как описано в статье:

source: Pdfdoes all the typesetting and creates a PDF file of the cave map.
ru_ru: Pdf собирает все фрагменты и создает PDF-файл карты пещеры.

source: Percentual loop error is calculated as { absolute error / loop length}.
ru_ru: Процентная погрешность кольца вычисляется как { абсолютная ошибка/\breakдлину кольца}.

source: Point is a command for drawing a point map symbol.
ru_ru: Точка -- это команда для рисования символа точки.

source: Point symbols are defined as macros using |def ... enddef;| commands.
ru_ru: Точечные символы определяются как макросы с использованием команд\break |def ... enddef;|.

source: Point symbols.
ru_ru: Точечные символы.

source: Possible algorithms are |line|---the default; |plaquette|---invented by Marco Corvi.
ru_ru: Возможные алгоритмы: |line| -- по умолчанию; |plaquette| -- разработанный Marco Corvi.

source: Possible comments follow the `|#|' character.
ru_ru: Можно\break добавлять комментарии за символом `|#|'.

source: Possible continuations are treated special way in therion in both centerline and map files.
ru_ru: Возможные продолжения обрабатываются особым образом в области как нитки хода, так и в файлах карт.

source: Precomposed accented letters are included for Slovak and Czech languages.], standard and .
ru_ru: Предустановленные буквы с акцентом включены для словацкого и чешского языков.], стандартные и .

source: Predefined macros are compiled into the Therion executable and are copied to the working directory just before running and (unless the |--use-extern-libs| option is used).
ru_ru: Предопределенные макросы компилируются в исполняемый файл Therion'а и копируются в рабочий каталог непосредственно перед запуском и (если не используется опция |--use-extern-libs|).

source: Predefined map header contains some basic information about cave: name, scale, north arrow, list of surveyors etc.
ru_ru: Предопределенный заголовок карты содержит некоторую базовую\break информацию о пещере: имя, масштаб, направление на север, список\break съемщиков и т.д.

source: Prefix will be removed from station names.
ru_ru: Префикс будет удален из имен станций.

source: Preview is displayed only if the map is in the |map-level| level as specified by the |select| command.
ru_ru: Карта отображается, только если она находится на уровне |map-level|,\break заданный командой |select|.

source: Processing data.
ru_ru: Обработка данных.

source: Program names are in roman font, data files in italics.
ru_ru: Названия программ отображены прямым шрифтом, а файлы данных выделены курсивом.

source: Quick start.
ru_ru: Быстрый старт.

source: Quotes are used for strings; brackets for numerical values and keywords.
ru_ru: Кавычки\break используются для строк; скобки для числовых значений и ключевых слов.

source: Ranges for |<x>| and |<y>| are -100--200.
ru_ru: Диапазоны для |<x>| и |<y>| -- 0-100.

source: Rather than offer even more options for the |layout| command, Therion uses the language to describe other page layouts.
ru_ru: Вместо того, чтобы использовать еще больше опций для команды |layout|, Therion использует язык для описания других макетов страниц.

source: Read the { Appendix} if you want to compile Therion yourself.
ru_ru: Прочтите { Приложение}, если вы хотите\break скомпилировать Therion самостоятельно.

source: Reading is one of the following keywords: station, from, to, tape/length, [back]compass/[back]bearing, [back]clino/0[back]gradient, depth, fromdepth, todepth, depthchange, counter, fromcount, tocount, northing, easting, altitude, up/ceilingdimension may be specified as a pair |[<from> <to>"5D|, meaning the size at the beginning and end of the shot], down/floor, left, right, ignore, ignoreall.
ru_ru: Считывание может принимать одно из следующих ключевых слов: station (станция), from (начальная станция), to (конечная\break станция), tape/length (длина), [back]compass/[back]bearing (азимут),\break [back]clino/[back]gradient (угол наклона), depth (глубина), fromdepth (от глубины), todepth (до глубины), depthchange (изменение глубины), counter (счетчик), fromcount (от счетчика), tocount (к счетчику), northing (север), easting (восток), altitude (высотная отметка), up/ceiling (высота потолка)Размер может быть задан как пара |[<from> <to>"5D|, что означает размер в начале и в конце замера.], down/floor, left, right, ignore, ignoreall.

source: Reads survey data in different formats (currently processed centreline in *.3d, *.plt, *.xyz formats).
ru_ru: Считывает данные съемки в разных форматах (в настоящее время\break обрабатывается нитка хода в форматах *.3d, *.plt и *.xyz).

source: Recommended ranges are $<-0.5u,0.5u>$ in both axes.
ru_ru: Рекомендуемые диапазоны: $<-0.5u,0.5u>$ в обоих осях.

source: Required for |slope| type.
ru_ru: Требуется для типа |slope| (склон).

source: Resulting table looks like this
ru_ru: Итоговая таблица выглядит так:

source: Right-click on the menu button and select in the menu which of the other menus it should be swapped with.
ru_ru: Щелкните правой кнопкой мыши по кнопке меню и выберите в меню тот пункт, который вы хотите здесь отображать.

source: Run the setup program and follow instructions.
ru_ru: Запустите программу установки и следуйте инструкциям.

source: Run:
ru_ru: Запустите:

source: Running Therion.
ru_ru: Запуск Therion'а.

source: SQL export makes it easy to get very detailed and subtle information about centreline.
ru_ru: Экспорт SQL позволяет легко получить очень подробную информацию о нитке хода.

source: SQL export.
ru_ru: Экспорт SQL.

source: SVG map: unlimited * scraps count = approx. 500--6000, depending on frequency of cross-sections
ru_ru: SVG-карта: без ограничений; * количество скрапов = примерно 500--6000, в зависимости от частоты\break поперечных сечений

source: Sample cave
ru_ru: Пример пещеры

source: Saves some typing.
ru_ru: Для сохранения типизации.

source: Scale (100 DPI image resolution is assumed) and grid-size from layout are used in export.] and {5.3}|bbox|Text file containing geographic coordinates of lower-left and upper-right corners of the map area.] for map; |pdf| for atlas are supported.
ru_ru: |Scale| (принято разрешение изображения в 100 DPI) и |grid-size| макета используются в экспорте.] и {5.3}|bbox|Текстовый файл, содержащий географические координаты нижнего левого и верхнего правого углов области карты.] для карты; |pdf| для атласа.

source: Scrap border consists of lines with the |-outline out| or |-outline in| options (passage walls have |-outline out| by default).
ru_ru: Граница скрапа состоит из линий с опцией |-outline out| или |-outline in| (стены хода по умолчанию имеют опцию |-outline out|).

source: Scrap consists of point, line and area map symbols.
ru_ru: Скрап состоит из точечных, строковых и областных символов.

source: Scrap distortion is calculated using the distortion measure defined for all pairs of points (point symbols, points and control points of line symbols) in the scrap.
ru_ru: Искажение скрапа вычисляется с использованием меры искажения,\break определенной для всех пар точек (точечные символы, точки и контрольные точки линейных символов) в скрапе.

source: Scrap is a piece of 2D map, which doesn't contain overlapping passages (i.e. all the passages may be drawn on the paper without overlapping).
ru_ru: Скрап -- это часть 2D-карты, которая не содержит пересекающихся ходов (т.е. все хода могут быть нарисованы на бумаге не пересекаясь).

source: Scrap is the basic building block of the map.
ru_ru: Скрап является основным блоком карты.

source: Scrap outlines can't intersect themselves---otherwise the inner side of the scrap can't be determined.
ru_ru: Границы скрапа не могут пересекаться, иначе внутренняя сторона скрапа не может быть определена.

source: Scraps are usually stored in |*.th2| files.
ru_ru: Скрапы обычно хранятся в |*.th2| файлах.

source: Scraps in general are independent on centreline hierarchy so try to forget the survey hierarchy when drawing maps and choose best scrap joins.
ru_ru: Скрапы в целом независимы от иерархии нитки хода, поэтому старайтесь не привязываться к съемке когда рисуете карты и\break выбираете лучшие объединения скрапов.

source: See Survex manual for details.
ru_ru: Смотрите руководство к Survex для подробностей.

source: See also an example in the { Appendix}.
ru_ru: Смотрите также примеры в { Приложении}.

source: See below for a list of predefined texts which may be used in the atlas.
ru_ru: Ниже приведен список предопределенных настроек текстов, которые могут быть использованы в атласе.

source: See chapter { How the map is put together} for explanation how and in which order are they displayed.
ru_ru: Смотрите главу {Как карта собирается в единое целое} для объяснения, как и в котором порядке они выводятся при отображении.

source: See declination option of survey command.
ru_ru: Смотрите опцию\break declination команды survey.

source: See the chapter { How the map is put together} for more thorough explanation.
ru_ru: Смотрите главу { Как собрать карту} для более подробного объяснения.

source: See the chapter { How the map is put together}.] |bedrock|, |sand|, |raft|, |clay|, |pebbles|, |debris|, |blocks|, |water|, |ice|, |guano|, |snow|;
ru_ru: Смотрите главу {Как карта собирается в единое целое}.]{:} |bedrock| (коренная порода), |sand| (песок), |raft| (конус), |clay| (глина), |pebbles| (галька), |debris| (щебень), |blocks| (навал глыб), |water| (вода), |ice| (лед), |guano| (гуано), |snow| (снег);

source: See the chapter { Changing layout/Customizing text labels} for details how to change labels' appearance.
ru_ru: Смотрите главу { Изменение макета/Настройка текстовых меток}, чтобы узнать, как изменить внешний вид надписей.

source: See the copyright page for the list of available languages.
ru_ru: Список доступных языков смотрите на\break странице авторских прав;

source: See the description of the || macro below for how to extract and use this information.
ru_ru: Смотрите описание макроса || ниже, чтобы знать, как извлечь и использовать эту информацию.

source: See the description of |scrap| command for details.
ru_ru: Смотрите описание |scrap| для\break подробностей.

source: See the { Appendix} if you want to add or customize translations.
ru_ru: Смотрите { Приложение}, если вы хотите добавить или настроить переводы.

source: See |sd| option description for |centreline| command.
ru_ru: Смотрите опцию |sd| в описании команды |centreline|.

source: Sep: Therion compiles first real and complex map of a cave.
ru_ru: Сентябрь: Therion собирает первую реальную и сложную карту пещеры.

source: Set options.
ru_ru: Устанавливает опции ;

source: Set default units.
ru_ru: Устанавливает единицы по умолчанию;

source: Set the default output encoding (currently unused).
ru_ru: Устанавливает стандартную выходную кодировку (в настоящее время не используется);

source: Set the default output encoding for SQL export.
ru_ru: Устанавливает стандартную выходную кодировку для экспорта SQL;

source: Set the full path to ImageMagick's convert executable if Therion can't find it (``|convert|'' is the default).
ru_ru: Устанавливает полный путь к исполняемому файлу ImageMagick, если\break Therion не может его найти (``|convert|'' является значением по умолчанию);

source: Set the full path to ImageMagick's identify executable if Therion can't find it (``|identify|'' is the default).
ru_ru: Устанавливает полный путь к идентификатору ImageMagick, если Therion не может его найти (``|ident|'' является значением по умолчанию);

source: Set the full path to a executable if Therion can't find it (``|mpost|'' is the default).
ru_ru: Устанавливает полный путь к исполняемому файлу , если\break Therion не сможет его найти (``|mpost|'' является значением по умолчанию);

source: Set the full path to a pdfexecutable if Therion can't find it (``|pdfetex|'' is the default).
ru_ru: Устанавливает полный путь к исполняемому файлу pdf, если Therion не сможет его найти (``|pdfetex|'' является значением по умолчанию);

source: Set to |on| if you use other distribution for maps processing.
ru_ru: Установите в |on|, если вы используете другой дистрибутив для\break обработки карт;

source: Set-up fonts to be used in PDF maps.
ru_ru: Настройка шрифтов, которые будут использоваться в PDF-картах.

source: Sets the survey stations equivalence.
ru_ru: Устанавливает эквивалентность станций съемки.

source: Setting-up environment.
ru_ru: Настройка среды.

source: Settings which apply to atlas mode are marked `A'; map mode `M'.
ru_ru: Настройки, применяемые к режиму атласа,\break отмечены `A'; к режиму карт -- `M'.

source: Similar to |*.th| files, there may be one file |INDEX.th2| per directory which includes all |*.th2| files, defines scrap joins and maps.
ru_ru: Можно создавать один файл |INDEX.th2| на каталог, который подключает все |*.th2| файлы, описывает maps и объединения скрапов.

source: Similar to |tex-fonts|, but tests if the fonts are installed in the system.
ru_ru: Подобно смотрите в |tex-fonts|, но дополнительно проверяется, установлены ли в системе шрифты .

source: Simple click in the { Survey structure} tree displays some basic information about the survey in the { Survey info} menu.
ru_ru: Простой щелчок в дереве { Структура съемки} отображает основную информацию о съемке в меню { Информация}.

source: So if you want to keep your centerline in survex files you need to solve the problem how to match survex and therion data structures.
ru_ru: Поэтому, если вы хотите сохранить свою нитку хода указанную в файлах survex, вам нужно решить проблему, как совместить структуры данных survex и Therion'а.

source: So we could either draw the whole Atlas again, or accept that the location of some places was not accurate---in the case of loops with a length of approximately 1 km there were sometimes errors of about 10 m---and try to distort the new passages to fit to old ones.
ru_ru: Таким образом мы могли бы перерисовывать весь Атлас снова, или принять, что местоположение некоторых новых мест на карте было изображено не точно (в случае колец с длиной около 1 км ошибки достигали 10 м) и пытаться подогнать новые хода к старым съемкам.

source: So you should be familiar with the plain if you wish to define new layouts.
ru_ru: Поэтому вы должны быть знакомы с plain , если хотите определить новые макеты.

source: So your code will be like this:
ru_ru: Таким образом, ваш код будет выглядеть так:

source: So, now it's clear what Therion needs, let's have a look at the way it interacts with all these programs:
ru_ru: Итак, теперь ясно, что нужно Therion'у, давайте посмотрим как он\break взаимодействует со всеми этими программами:

source: So, the first step is defining the { scrap} by a |scrap ... endscrap| multi-line command.
ru_ru: Итак, первым шагом является определение { скрапа} с помощью\break |scrap ... endscrap| многострочной команды.

source: Software requirements.
ru_ru: Требования к ПО.

source: Some computer programs existed which displayed survey shots and stations after loop closure and error elimination.
ru_ru: Имелось несколько компьютерных программ, которые строили нитку хода после\break закрытия колец и разброса ошибки.

source: Some information is lost in the PFB format, but there is advantage that pdfcan embed subset of PFB fonts (in contrast with OpenType fonts which must be fully embedded).
ru_ru: Некоторая информация теряется в формате PFB, но есть преимущество в том, что pdfможет встраивать часть шрифтов PFB (в отличие от шрифтов OpenType, которые должны быть встроены полностью);

source: Some obscure accents might be omitted.
ru_ru: Некоторые неявные акценты могут быть\break опущены.

source: Sometimes options have no or multiple values.
ru_ru: Иногда параметров нет или может быть несколько\break значений.

source: Source code and Windows installer are available on the Therion web page ({https://therion.speleo.sk}).
ru_ru: Исходный код и установщик для Windows доступны на веб-странице\break({https://therion.speleo.sk}).

source: Special symbols.
ru_ru: Специальные символы.

source: Special-purpose maps.
ru_ru: Специальные карты.

source: Specifies layout for 2D maps.
ru_ru: Задает макет для 2D-карт.

source: Specifies translation of any default therion text in output.
ru_ru: Задает перевод текста по умолчанию для вывода.

source: Specifies which scrap warping (morphing) algorithm to use.
ru_ru: Указывает, какой алгоритм преобразования скрапа (морфинг) использовать.

source: Specifies which source (data) files Therion should read.
ru_ru: Указывает, какие файлы съемки (данных) Therion должен читать.

source: Standard name for user-defined symbol types should not include symbol set identifier, e.g. |p_u_bat|.
ru_ru: Стандартное имя для\break пользовательских типов символов не должно включать идентификатор\break набора символов, например |p_u_bat|.

source: Starting with the release 5.4.1 you can use |fonts-setup| layout option instead of the macro |fonts_setup()|.
ru_ru: Начиная с версии 5.4.1 вы можете использовать опцию |fonts-setup| макета вместо макроса |fonts_setup()|.

source: Station names are before '@' symbol, survey names follow this symbol.
ru_ru: Названия станций перед символом '@', названия съемок после этого символа.

source: Station names are taken from .3d files without change.
ru_ru: Названия станций берутся из .3d файлов без изменений.

source: Studying the example files distributed with Therion will help you understand.
ru_ru: Изучение примеров файлов, распространяемых вместе с Therion'ом, поможет вам понять основы.

source: Supported flags: |entrance|, |continuation|, |air-draught[:winter/summer]|, |sink|, |spring|, |doline|, |dig|, {5.3}|arch|, |overhang|.
ru_ru: Поддерживаемые флаги: |entrance| (вход), |continuation| (продолжение),\break |air-draught[:winter/summer]| (ток воздуха:зима/лето), |sink| (понор), |spring| (источник), |doline| (карстовая воронка), |dig| (раскоп), {5.3}|arch| (свод), |overhang| (нависание потолка).

source: Suppose you want to add a new language |xx|.
ru_ru: Предположим, вы хотите добавить новый язык |xx|:

source: Surface (terrain) specification.
ru_ru: Спецификация поверхности (рельефа).

source: Surface is currently exported in |therion| format only.
ru_ru: Поверхность в настоящее время экспортируется только в формате |therion|.

source: Survey becomes a cave, if it has main entrance station specified using |-entrance| option.
ru_ru: Съемка становится пещерой, если у нее есть станция с опцией |-entrance|.

source: Survey data (centreline) specification.
ru_ru: Описание данных survey (нитки хода).
